//HERC01XX JOB (PROJ4),                    
//             'EXECUTA PROJ4',            
//             CLASS=C,                    
//             MSGCLASS=X,                 
//             REGION=8M,TIME=1440,        
//             MSGLEVEL=(1,1),NOTIFY=HERC01
//COMPILA  EXEC COBOL,                     
//         PROG='PROJ4',                   
//         BIBF='HERC01.COBOL',            
//         BIBC='HERC01.LOAD'              